Tekla Open API Reference for Tekla Structures 2025
CustomObservableCollection<T>.Repopulate Method
 CustomObservableCollection repopulator, sends notification about property and collection change.
 Namespace: Tekla.Structures.Dialog.UIControls
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public void Repopulate(
	IEnumerable<T> collection
)
Public Sub Repopulate (
	collection As IEnumerable(Of T)
)
Parameters
collection
Type: System.Collections.Generic.IEnumerable<T>
The collection used in repopulation.
See Also
Reference
CustomObservableCollection<T> Class
Tekla.Structures.Dialog.UIControls Namespace